# DoorOperationType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DoorOperationType Property
ParameterTypeId Class See Also
---
"Operation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DoorOperationType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DoorOperationType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DoorOperationType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace